Repository: Daniel-KM/Omeka-S-module-Mirador
Catalog: language/*.po
Languages: fr

source: This module requires the module "%s", version %s or above.
fr: Ce module requiert le module « %s », version « %s » ou supérieure.

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: The module supports audio and video for Mirador v3.
fr: Le module gère l’audio et la vidéo pour Mirador v3.

source: The module supports Mirador v4.
fr: Le module gère désormais Mirador v4.

source: Warning: if you customized theme, note that settings were renamed.
fr: Attention : si vous avez personnalisé les thèmes, notez que les noms des paramètres ont été modifiés.

source: Mirador v4 now uses ecmascript modules with import maps instead of pre-compiled bundles. Plugins are now loaded individually and locally, in a GDPR-compliand way.
fr: Mirador v4 utilise désormais les modules ecmascript avec des cartes d’import et non plus des paquets précompilés. Les extensions sont désormais chargées individuellement et localement, de façon compatible avec la RGPD.

source: The library "{library}" should be installed. See module’s installation documentation.
fr: La bibliothèque « {library} » doit être installée. Consulter la documentation d’installation du module.

source: Settings for Mirador config of items is not a valid json.
fr: Les paramètres de la configuration de Mirador pour les contenus ne sont pas un json valide.

source: Settings for Mirador config of collections is not a valid json.
fr: Les paramètres de la configuration de Mirador pour les collections ne sont pas un json valide.

source: Skip default css
fr: Ignorer le css par défaut

source: Players
fr: Lecteurs

source: Mirador version
fr: Version de Mirador

source: 2.7 (light)
fr: 2.7 (léger)

source: 3.4.3 (deprecated)
fr: 3.4.3 (obsolète)

source: 4.0 and above
fr: 4.0 et plus récent

source: Mirador plugins for v2
fr: Extensions Mirador pour v2

source: Some plugins require json options to work. Cross compatibility has not been checked, so add them one by one and only the needed ones.
fr: Certains plugins nécessitent des options en json pour fonctionner. La compatibilité croisée n’a pas été vérifiée. Il est donc recommandé de les ajouter un par un et seulement les plugins nécessaires.

source: Select plugins…
fr: Choisir des plugins…

source: Mirador json config for v2 (item)
fr: Configuration Mirador en json pour la v2 (contenu)

source: This json object will be merged with the default one generated by the module. Placeholders: {manifestUri} and {canvasID}.
fr: Cet objet json sera fusionné avec celui préparé par le module. Jokers : {manifestUri} et {canvasID}.

source: Mirador json config for v2 (collection)
fr: Configuration Mirador en json pour la v2 (collection)

source: Iiif collections are Omeka item sets, but may be search results too.
fr: Les collections Iiif sont des collections Omeka, mais peuvent également être des résultats de recherche.

source: Mirador plugins for v3
fr: Extensions Mirador pour v3

source: Mirador config as object string for v3 (item)
fr: Configuration Mirador en chaîne objet pour la v3 (contenu)

source: This object will be merged with the default one generated by the module.
fr: Cet objet sera fusionné avec celui préparé par le module.

source: Mirador config as object string for v3 (collection)
fr: Configuration Mirador en chaîne objet pour la v3 (collection)

source: Mirador plugins for v4
fr: Extensions Mirador pour v4

source: Mirador config as object string for v4 (item)
fr: Configuration Mirador en chaîne objet pour la v4 (contenu)

source: Mirador config as object string for v4 (collection)
fr: Configuration Mirador en chaîne objet pour la v4 (collection)

source: Endpoint to store annotations externally
fr: Point d’accès pour enregistrer les annotations à l’extérieur

source: This option is used only if the plugin Annotations is enabled, and useful only with an external annotation server.
fr: Cette option est utilisée seulement quand l’extension Annotations est activée et avec un serveur d’annotations externe .

source: Preselect manifests from the same collection
fr: Présélectionner des manifestes à partir de la même collection

source: Set a number of items to preselect. IiifServer should be enabled.
fr: Indiquer le nombre de contenus à présélectionner. Le module IIIF Server doit être actif.

source: Property supplying an external manifest
fr: Propriété fournissant un manifeste tiers

source: External or static manifests can be more customized and may be quicker to be loaded. Usually, the property is "dcterms:hasFormat" or "dcterms:isFormatOf".
fr: Les manifestes externes ou statiques peuvent être personnalisés et sont plus rapides à charger. Généralement, la propriété utilisée est « dcterms:hasFormat » ou « dcterms:isFormatOf ».

source: Select a property…
fr: Choisir une propriété…
